W9D1/first_routes/app/controllers/artwork_shares_controller.rb

    def index
        render json: ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

    def create

        artwork_share = ArtworkShare.new(artwork_id: params[:artwork_id], viewer_id: params[:viewer_id])
        if artwork_share.save
---
INSERT INTO "artwork_shares" ("viewer_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["viewer_id", 3], ["artwork_id", 100], ["created_at", "2019-12-10 23:05:35.682857"], ["updated_at", "2019-12-10 23:05:35.682857"]]