W9D1/first_routes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."viewer_id" = $1 ORDER BY "artwork_shares"."id" ASC LIMIT $2  [["viewer_id", 1], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def index

        artwork = Artwork.where(artist_id: params[:user_id])
        artwork_shares = ArtworkShare.where(viewer_id: params[:user_id])
        artwork2 = Artwork.where(id: artwork_shares.first)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1  [["id", 1]]
---
    def show
        artwork = Artwork.find(params[:id])

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "not andy art"], ["image_url", "hotpicture.com"], ["artist_id", 4], ["created_at", "2019-12-10 22:06:48.495443"], ["updated_at", "2019-12-10 22:06:48.495443"]]
---
    def create

        artwork = Artwork.new(title: params[:title], image_url: params[:image_url], artist_id: params[:artist_id])
        if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 200], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "cool art"], ["image_url", "hotpicture3.com"], ["updated_at", "2019-12-10 22:10:29.883566"], ["id", 1]]
---
    def update
        artwork = Artwork.find(params[:id])
        artwork.title = params[:title]
        artwork.image_url = params[:image_url]
        if artwork.save