W9D1/first_routes/app/controllers/comments_controller.rb

    def index
        render json: Comment.all
---
SELECT "comments".* FROM "comments"