W9D1/first_routes/app/controllers/users_controller.rb

    def index
        # render plain: 'Hello, World!!!'
        render json: User.all
---
SELECT "users".* FROM "users"

    def create
        # user = User.new(params[:username])
        user = User.new(username: params[:username])
        if user.save
---
INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "liz"]]

    def update
        user = User.find(params[:id])
        user.username = params[:username]
        if user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "not andy"], ["id", 4]]