w9d5/music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ADTR"], ["created_at", "2019-12-30 15:11:48.188871"], ["updated_at", "2019-12-30 15:11:48.188871"]]
---
  def create
    @band = Band.new(name: params[:band][:name])

    if @band.save