W9D3/cats99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "          cute cat with mustachnke         "], ["updated_at", "2019-12-11 23:57:56.844163"], ["id", 3]]
---
    def update
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)